app/controllers/users_controller.rb

	def create
	  @user = User.create(username: params[:username], password: params[:password])
---
INSERT INTO "users" ("created_at", "password", "updated_at", "username") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 18 Jul 2014 03:16:21 UTC +00:00], ["password", "password"], ["updated_at", Fri, 18 Jul 2014 03:16:21 UTC +00:00], ["username", "rj"]]

	def show
		user = User.find_by_username(params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'rj' LIMIT 1